In [1]:
import pandas as pd
pd.__version__

'1.4.3'

In [5]:
people = {
    'first_name': ['Ali', 'Raib', 'Seli', 'Ily'],
    'last_name': ['Bumi', 'Bulan', 'Matahari', 'Bulan'],
    'email': ['alibumi@gmail.com', 'raibbintang@gmail.com', 'selimatahari@gmail.com', 'ilybulan@gmail.com']
}

df = pd.DataFrame(people)

In [6]:
df

  first_name last_name                   email
0        Ali      Bumi       alibumi@gmail.com
1       Raib     Bulan   raibbintang@gmail.com
2       Seli  Matahari  selimatahari@gmail.com
3        Ily     Bulan      ilybulan@gmail.com

In [10]:
filt1 = df['last_name'] == 'Bulan'

In [11]:
df[filt1]

  first_name last_name                  email
1       Raib     Bulan  raibbintang@gmail.com
3        Ily     Bulan     ilybulan@gmail.com

In [12]:
df[df['last_name'] == 'Bumi']

  first_name last_name              email
0        Ali      Bumi  alibumi@gmail.com

In [15]:
df.loc[filt1]

  first_name last_name                  email
1       Raib     Bulan  raibbintang@gmail.com
3        Ily     Bulan     ilybulan@gmail.com

In [16]:
df.loc[filt1, 'email']

1    raibbintang@gmail.com
3       ilybulan@gmail.com
Name: email, dtype: object

In [18]:
filt2 = (df['first_name'] == 'Raib') & (df['last_name'] == 'Bulan')

In [19]:
df.loc[filt2]

  first_name last_name                  email
1       Raib     Bulan  raibbintang@gmail.com

In [21]:
filt3 = (df['last_name'] == 'Bumi') | (df['last_name'] == 'Bulan')
df.loc[filt3]

  first_name last_name                  email
0        Ali      Bumi      alibumi@gmail.com
1       Raib     Bulan  raibbintang@gmail.com
3        Ily     Bulan     ilybulan@gmail.com

In [24]:
filt4 = df['last_name'] == 'Bulan'
df.loc[-filt4]

  first_name last_name                   email
0        Ali      Bumi       alibumi@gmail.com
2       Seli  Matahari  selimatahari@gmail.com